# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |
print("Введите число: ")
a = int(input())

if a > 99 and a < 1000:
    number = a // 100 
    number += (a % 100)//10
    number += (a % 10)
    print(number)
else:
    print("Введите 3-х значное число!")