# Задача 6: Вы пользуетесь общественным транспортом? 
# Вероятно, вы расплачивались за проезд и получали билет с номером. 
# Счастливым билетом называют такой билет с шестизначным номером,
# где сумма первых трех цифр равна сумме последних трех. 
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета.

# *Пример:*

# 385916 -> yes
# 123456 -> no

number = int(input("Введите число: "))

if number > 99999 and number < 1000000:

    number_1 = number //1000
    number_2 = number % 1000

    sum_1 = number_1 // 100 
    sum_1 += (number_1 % 100)//10
    sum_1 += (number_1 % 10)

    sum_2 = number_2 // 100 
    sum_2 += (number_2 % 100)//10
    sum_2 += (number_2 % 10)

    if sum_1 == sum_2:
        print("YES")
    else:
        print("NO")
    
else:
    print("Введите 6-ти значное число!")